IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MPU_R5SS0_CORE0_AHB_MPU_R5SS0_CORE0_AHB.xml
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_12_START_ADDRESS" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_12_START_ADDRESS" offset="0x2B0" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_12_END_ADDRESS" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_12_END_ADDRESS" offset="0x2B4" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_12_MPPA" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_12_MPPA" offset="0x2B8" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Reserved not used in Design" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="Reserved not used in Design" range="25 - 10" rwaccess="RO"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Reserved not used in Design" range="9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Reserved not used in Design" range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Reserved not used in Design" range="7" rwaccess="RO"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Reserved not used in Design" range="6" rwaccess="RO"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Reserved not used in Design" range="5" rwaccess="RO"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Reserved not used in Design" range="4" rwaccess="RO"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Reserved not used in Design" range="3" rwaccess="RO"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="Reserved not used in Design" range="2" rwaccess="RO"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="Reserved not used in Design" range="1" rwaccess="RO"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="Reserved not used in Design" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_13_START_ADDRESS" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_13_START_ADDRESS" offset="0x2C0" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_13_END_ADDRESS" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_13_END_ADDRESS" offset="0x2C4" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_13_MPPA" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_13_MPPA" offset="0x2C8" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Reserved not used in Design" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="Reserved not used in Design" range="25 - 10" rwaccess="RO"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Reserved not used in Design" range="9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Reserved not used in Design" range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Reserved not used in Design" range="7" rwaccess="RO"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Reserved not used in Design" range="6" rwaccess="RO"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Reserved not used in Design" range="5" rwaccess="RO"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Reserved not used in Design" range="4" rwaccess="RO"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Reserved not used in Design" range="3" rwaccess="RO"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="Reserved not used in Design" range="2" rwaccess="RO"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="Reserved not used in Design" range="1" rwaccess="RO"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="Reserved not used in Design" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_14_START_ADDRESS" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_14_START_ADDRESS" offset="0x2D0" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_14_END_ADDRESS" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_14_END_ADDRESS" offset="0x2D4" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_14_MPPA" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_14_MPPA" offset="0x2D8" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Reserved not used in Design" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="Reserved not used in Design" range="25 - 10" rwaccess="RO"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Reserved not used in Design" range="9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Reserved not used in Design" range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Reserved not used in Design" range="7" rwaccess="RO"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Reserved not used in Design" range="6" rwaccess="RO"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Reserved not used in Design" range="5" rwaccess="RO"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Reserved not used in Design" range="4" rwaccess="RO"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Reserved not used in Design" range="3" rwaccess="RO"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="Reserved not used in Design" range="2" rwaccess="RO"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="Reserved not used in Design" range="1" rwaccess="RO"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="Reserved not used in Design" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_15_START_ADDRESS" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_15_START_ADDRESS" offset="0x2E0" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_15_END_ADDRESS" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_15_END_ADDRESS" offset="0x2E4" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_15_MPPA" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_15_MPPA" offset="0x2E8" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Reserved not used in Design" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="Reserved not used in Design" range="25 - 10" rwaccess="RO"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Reserved not used in Design" range="9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Reserved not used in Design" range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Reserved not used in Design" range="7" rwaccess="RO"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Reserved not used in Design" range="6" rwaccess="RO"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Reserved not used in Design" range="5" rwaccess="RO"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Reserved not used in Design" range="4" rwaccess="RO"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Reserved not used in Design" range="3" rwaccess="RO"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="Reserved not used in Design" range="2" rwaccess="RO"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="Reserved not used in Design" range="1" rwaccess="RO"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="Reserved not used in Design" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_16_START_ADDRESS" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_16_START_ADDRESS" offset="0x2F0" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_16_END_ADDRESS" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_16_END_ADDRESS" offset="0x2F4" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_16_MPPA" acronym="MPU_R5SS0_CORE0_AHB_PROGRAMMABLE_16_MPPA" offset="0x2F8" width="32" description="">
		<bitfield id="RESERVED" width="6" begin="31" end="26" resetval="0x0" description="Reserved not used in Design" range="31 - 26" rwaccess="RO"/> 
		<bitfield id="AID15_0" width="16" begin="25" end="10" resetval="0x0" description="Reserved not used in Design" range="25 - 10" rwaccess="RO"/> 
		<bitfield id="AIDX" width="1" begin="9" end="9" resetval="0x0" description="Reserved not used in Design" range="9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Reserved not used in Design" range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x1" description="Reserved not used in Design" range="7" rwaccess="RO"/> 
		<bitfield id="EMU" width="1" begin="6" end="6" resetval="0x0" description="Reserved not used in Design" range="6" rwaccess="RO"/> 
		<bitfield id="SR" width="1" begin="5" end="5" resetval="0x0" description="Reserved not used in Design" range="5" rwaccess="RO"/> 
		<bitfield id="SW" width="1" begin="4" end="4" resetval="0x0" description="Reserved not used in Design" range="4" rwaccess="RO"/> 
		<bitfield id="SX" width="1" begin="3" end="3" resetval="0x0" description="Reserved not used in Design" range="3" rwaccess="RO"/> 
		<bitfield id="UR" width="1" begin="2" end="2" resetval="0x0" description="Reserved not used in Design" range="2" rwaccess="RO"/> 
		<bitfield id="UW" width="1" begin="1" end="1" resetval="0x0" description="Reserved not used in Design" range="1" rwaccess="RO"/> 
		<bitfield id="UX" width="1" begin="0" end="0" resetval="0x0" description="Reserved not used in Design" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_FAULT_ADDRESS" acronym="MPU_R5SS0_CORE0_AHB_FAULT_ADDRESS" offset="0x300" width="32" description="">
		<bitfield id="FAULT_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Fault address." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_FAULT_STATUS" acronym="MPU_R5SS0_CORE0_AHB_FAULT_STATUS" offset="0x304" width="32" description="">
		<bitfield id="ID" width="8" begin="31" end="24" resetval="0x0" description="Transfer ID" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="MSTID" width="8" begin="23" end="16" resetval="0x0" description="Master ID." range="23 - 16" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="3" begin="15" end="13" resetval="0x0" description="Always read as 0." range="15 - 13" rwaccess="RO"/> 
		<bitfield id="PRIVID" width="4" begin="12" end="9" resetval="0x0" description="Privilege ID." range="12 - 9" rwaccess="RO"/> 
		<bitfield id="RESERVED1" width="1" begin="8" end="8" resetval="0x0" description="Always read as 0." range="8" rwaccess="RO"/> 
		<bitfield id="NS" width="1" begin="7" end="7" resetval="0x0" description="Non-secure access." range="7" rwaccess="RO"/> 
		<bitfield id="RESERVED2" width="1" begin="6" end="6" resetval="0x0" description="Always read as 0." range="6" rwaccess="RO"/> 
		<bitfield id="FAULT_TYPE" width="6" begin="5" end="0" resetval="0x0" description="Fault type.100000 = supervisor read fault010000 = supervisor write fault001000 = supervisor execute fault000100 = user read fault000010 = user write fault000001 = user execute fault111111 = relaxed cache linefill fault010010 = relaxed cache writeback fault000000 = no fault" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_R5SS0_CORE0_AHB_FAULT_CLEAR" acronym="MPU_R5SS0_CORE0_AHB_FAULT_CLEAR" offset="0x308" width="32" description="">
		<bitfield id="RESERVED" width="31" begin="31" end="1" resetval="0x0" description="Always read as 0." range="31 - 1" rwaccess="RO"/> 
		<bitfield id="FAULT_CLR" width="1" begin="0" end="0" resetval="0x0" description="Fault clear. Writing a 1 clears the current fault. Writing a0 has no effect." range="0" rwaccess="WO"/>
	</register>
</module>